Repository: cds-snc/gcds-examples
Catalog: starter-apps/angular/angular-template/src/locale/messages.*.xlf
Languages: fr

# common.pageTitle.home
source: Home
fr: Accueil

# common.pageTitle.about
source: About
fr: A Propos

# common.pageTitle.about.topic
source: Topic
fr: Sujet

# common.pageTitle.reportABug
source: Report a Bug
fr: Rapporter un bug

source: Top navigation
fr: Navigation du haut

# common.appName
source: Angular App
fr: App Angular

source: This Angular starter template integrates Design System components, providing a solid foundation for building modern, responsive web applications. It streamlines development by offering pre-built, customizable UI elements that ensure design consistency and flexibility. Perfect for both small-scale projects and large applications, this template helps you focus on delivering a polished user experience with minimal setup.
fr: Ce modèle de démarrage Angular intègre composants du Système de design GC, offrant une base solide pour la création d'applications Web modernes et réactives. Il rationalise le développement en proposant des éléments d'interface utilisateur prédéfinis et personnalisables qui garantissent la cohérence et la flexibilité de la conception. Parfait pour les projets à petite échelle comme pour les applications de grande envergure, ce modèle vous aide à vous concentrer sur la fourniture d'une expérience utilisateur soignée avec une configuration minimale.

source: This is a sample topic page within a parent About page. Here, you can see how the breadcrumb navigation behaves within the site structure. The breadcrumbs provide a visual guide for the current location on the site, allowing for seamless navigation between sections.
fr: Il s'agit d'un exemple de page de rubrique au sein d'une page À propos parente. Ici, vous pouvez voir comment la navigation par fil d'Ariane se comporte au sein de la structure du site. Le fil d'Ariane fournit un guide visuel pour l'emplacement actuel sur le site, permettant une navigation transparente entre les sections.

source: Welcome to the Angular Starter App that leverages GC Design System components!
fr: Bienvenue dans l'application Angular Starter qui exploite les composants du système de conception GC !

source: This starter app template is designed to help developers quickly set up a modern Angular application while adhering to the accessibility and design standards set by the Government of Canada.
fr: Ce modèle d'application de démarrage est conçu pour aider les développeurs à configurer rapidement une application Angular moderne tout en adhérant aux normes d'accessibilité et de conception définies par le gouvernement du Canada.

source: You'll find all the necessary setup, including Angular Routing, ESLint for linting, Jasmine for unit testing, @angular/localize for localization and a selection of GCDS components to get you started on your project.
fr: Vous trouverez tous les outils nécessaires, incluant Angular Routing, Esling pour le linting, Jasmine pour les tests unitaires, @angular/localize pour la localisation and une selection de composants GCDS pour vous aider a démarrer votre projet.

source: GC Design System Components Package and Version
fr: Paquet et version des composants de Système de design GC

source: e.g. @cdssnc/gcds-components-angular@0.x.x
fr: ex. @cdssnc/gcds-components-angular@0.x.x

source: Title
fr: Titre

source: Choose a title for your bug report
fr: Choisissez un titre pour votre rapport de bogue

source: Current Behavior
fr: Comportement observé

source: Describe the current behavior
fr: Décrivez le comportement observé

source: Expected Behavior
fr: Comportement attendu

source: Describe the expected behavior
fr: Décrivez le comportement attendu

source: System Info
fr: Information sur le système

source: Provide information about your system
fr: Fournir des informations sur votre système

source: Steps to Reproduce
fr: Étapes de reproduction du bogue

source: List the steps to reproduce
fr: Listez les étapes de reproduction du bogue

source: Code Reproduction URL
fr: URL de reproduction du code

source: Provide a URL to the code reproduction
fr: Fournir une URL pour la reproduction du code

source: Additionnal Information
fr: Informations supplémentaires

source: Provide any additionnal information
fr: Fournir des informations supplémentaires

source: Submit
fr: Envoyer

source: GC Design System Components Package and Version:
fr: Paquet et version des composants de Système de design GC:

source: Current Behavior:
fr: Comportement observé:

source: Expected Behavior:
fr: Comportement observé:

source: System Info:
fr: Information sur le système:

source: Steps to Reproduce:
fr: Étapes pour reproduire le bogue:

source: Code Reproduction URL:
fr: URL de reproduction du code:

source: Start an issue on GitHub
fr: Créer un ticket sur Github

source: Open issue on Github
fr: Ouvrir un ticket sur Github
